# Next.js + TypeScript + Drizzle ORM + Google Cloud Development Environment
# Essential development tools for macOS

# Core development tools
brew "git"                    # Version control
brew "gh"                     # GitHub CLI
brew "node"                   # Node.js runtime (LTS)
brew "pnpm"                   # Fast package manager
brew "yarn"                   # Alternative package manager

# Databases
brew "postgresql@16"          # PostgreSQL for production databases
brew "sqlite"                 # SQLite for local development
brew "redis"                  # Redis for caching/sessions

# Cloud development
cask "google-cloud-sdk"        # Google Cloud CLI for Vertex AI

# Development utilities
brew "docker"                  # Containerization
brew "docker-compose"          # Multi-container orchestration
brew "git-lfs"                 # Large file storage for Git
brew "jq"                      # JSON processor
brew "yq"                      # YAML processor
brew "tree"                    # Directory tree visualization
brew "htop"                    # System monitoring
brew "watch"                   # Execute commands periodically
brew "tldr"                    # Simplified man pages

# Text editors and IDEs
cask "visual-studio-code"       # Primary IDE
cask "cursor"                   # Alternative IDE

# Development tools
cask "postman"                  # API testing
cask "insomnia"                 # Alternative API testing
cask "tableplus"                # Database GUI
cask "gitkraken"                # Git GUI client

# Browsers for testing
cask "google-chrome"            # Primary browser
cask "firefox"                  # Cross-browser testing

# Communication
cask "slack"                    # Team communication
cask "discord"                  # Community/dev discussions

# Terminal improvements
brew "zsh"                      # Better shell
brew "zsh-autosuggestions"      # Auto-suggestions for zsh
brew "zsh-syntax-highlighting"  # Syntax highlighting for zsh
brew "tmux"                     # Terminal multiplexer
brew "fzf"                      # Fuzzy finder
brew "ripgrep"                  # Fast text search (rg command)
brew "fd"                       # Fast file finder

# Security and certificates
brew "mkcert"                   # Local HTTPS certificates
brew "nss"                      # Network security services

# Performance monitoring
brew "speedtest-cli"            # Internet speed testing